#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-TZqhsXbJdBVMAiCi

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_droplet.main: Refreshing state... [id=196151282]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_record.starling-webhooks: Refreshing state... [id=309351439]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
digitalocean_record.starling-listener: Refreshing state... [id=309272946]
digitalocean_record.opentracker: Refreshing state... [id=161872068]
digitalocean_record.root: Refreshing state... [id=126395676]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.main will be created
  + resource "digitalocean_kubernetes_cluster" "main" {
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + ha             = false
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "main"
      + region         = "lon1"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + surge_upgrade  = true
      + updated_at     = (known after apply)
      + urn            = (known after apply)
      + version        = "1.25.4-do.0"
      + vpc_uuid       = (known after apply)

      + maintenance_policy {
          + day        = (known after apply)
          + duration   = (known after apply)
          + start_time = (known after apply)
        }

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = false
          + id                = (known after apply)
          + name              = "worker-pool"
          + node_count        = 1
          + nodes             = (known after apply)
          + size              = "s-1vcpu-2gb"
        }
    }

  # digitalocean_project.blackboards will be updated in-place
  ~ resource "digitalocean_project" "blackboards" {
        id          = "d006b183-c896-4d41-a341-fb46d729eeb6"
        name        = "blackboards"
      ~ resources   = [
          - "do:domain:blackboards.pl",
          - "do:domain:opentracker.app",
          - "do:droplet:196151282",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>